[
  {"id": "Skin", "info": "Species prior to the evolution of the Dinosauria clade and in other branches of the phylogenetic tree have skin. Some species of pterosaurs, an evolutionary cousin to the dinosaurs, were shown to have filamentous hairlike structures that are unique to the pterosaur line. Although these filaments are not believed to be direct precursers to feathers in dinosaurs, it suggests the possibility that filamentous structures like those leading to the development of feathers evolved multiple times independently"},
  {"id": "Scales", "info": "Scales were found on all Dinosaurian species, the branching Pseudosuchia line, and persisting even into modern day birds. Some theories suggest feathers evolved through mutations in in genes that form scales."},
  {"id": "Quill Knobs", "info": "Quill knobs are small bone structures used as attachment points for flight feathers. They are suggestive of feathers when no fossilized evidence of feathers are found. They cannot be used as difinitive proof though as they could be other structures such as ligament attachment points misinterpreted as quill knobs."},
  {"id": "Filaments", "info": "Evidence of long tubular filaments have been found on a wide range of species. They have been found on multiple evolutionary branches and could suggest the initial formation early in the timeline and subsequent species losing the presence of filaments later on in some branches, or the emergence of filaments independently along multiple branches. In at least the branch leading to modern day birds it is believed this is the initial formation of what would eventually become feathers."},
  {"id": "Plumulaceous", "info": "Downy filamentous feathers that lack the more rigid and ordered structure of more complex pennaceous feathers. Believed to be the precursers to pennaceous feathers. There are many theories as to the purpose of these feathers such as communication and insulation. They are not designed to allow for flight."},
  {"id": "Pennaceous", "info": "Rigid structured feathers that are more complex than penacious feathers. They are planar with a stiff tubular structure called a rachis running up the middle. A key development for this type of feather are interlocking barbs along the filaments that allow the feather to maintain its shape. These feathers were potentially used for communication but could have also given and evolutionsary advantage to predatory dinosaurs by giving them lift when running uphill."},
  {"id": "Assymetrical", "info": "An evolutionarily advanced modulation on pennaceous feathers. The assymetrical design where one side is larger than the other allows the feathers to be aerodynamic and is essential for true flight."}
]
